posts/restoring-my-mac.html
<!doctype html>
<html lang="en-us">
  <head>
    
    <meta charset="utf-8">
    <title>My personal weblorg - Home</title>
    <meta name="description" content="">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="author" content="John Coltrane" />
    <meta name="description" content="my personal blog" />
    <meta name="keywords" content="" />
    <link rel="stylesheet" href="https://lccambiaghi.github.io/static/style.css" type="text/css" />
    <link rel="stylesheet" type="text/css" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css">
    
  </head>
  <body>
    

    
    <header>
      <h1 class="logo">
        <a href="https://lccambiaghi.github.io/">My personal weblorg</a>
      </h1>
      <a href="#main" class="visually-hidden">jump to main content</a>
      <nav>
        <ul class="menu">
          <li class="menu__item"><a class="menu__link" href="https://lccambiaghi.github.io/about.html">about</a></li>
          <li class="menu__item"><a class="menu__link" href="https://lccambiaghi.github.io/">blog</a></li>
        </ul>
        <ul class="social">
          <li class="social__item">
            <a class="social__link github" href="http://github.com/clarete/weblorg">
              <i class="fa fa-github" aria-hidden="true"></i>
              <span class="visually-hidden">github</span>
            </a>
          </li>
        </ul>
      </nav>
    </header>
    

    
    <main id="main">
      
<article class="post">
  <h1 class="post__title">
    Restoring my Mac
  </h1>
  <section class="post__meta">
    Oct 26, 2020
  </section>
  <section>
    
<div class="outline-2">
<h2 id="setup-org"><a id="orgb963f24"></a>setup.org</h2>
<div class="outline-text-2">
<p>
This week-end I restored my Mac.
I was having some major iCloud issues, my Documents and Desktop folders would not sync.
My Mac in general looked really tired.
</p>

<p>
I was prepared.
I took inspiration from a colleague's bash script to write my own configuration script, in <code>org-mode</code>.
This format allows me to organize my <code>sh</code> code blocks within headlines and comments.
I can then <code>tangle</code> the blocks to a file <code>setup.sh</code>, which I can run on the new Mac.
</p>

<p>
I can do this by having this property at the top of <code>setup.org</code>:
</p>
<pre class="example">
#+PROPERTY: header-args :tangle ~/git/org/personal/setup.sh
</pre>

<p>
This is the structure of the document:
</p>
<pre class="example">
* macOs settings
* brew
* zsh
* fonts
* cli
* gui
* dotfiles
* execute all
</pre>

<p>
In each section I have a <code>sh</code> code block.
This is an example block from the "gui" section:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-function-name">install_apps</span>() {
    <span class="org-builtin">echo</span> <span class="org-string">"Installing: base apps"</span>
    <span class="org-variable-name">BASE_APPS</span>=<span class="org-string">"google-chrome amethyst slack visual-studio-code firefox iterm2 iina menumeters 1password6 qbitorrent private-internet-access"</span>
    brew tap homebrew/cask-versions
    brew cask install $<span class="org-variable-name">BASE_APPS</span>
    <span class="org-builtin">echo</span> <span class="org-string">"Installing: docker"</span>
    brew cask install docker
    <span class="org-builtin">echo</span> <span class="org-string">"Installing: corporate"</span>
    <span class="org-variable-name">CORPORATE</span>=<span class="org-string">"microsoft-office keybase microsoft-azure-storage-explorer intune-company-portal microsoft-teams"</span>
    brew cask install $<span class="org-variable-name">CORPORATE</span>
}
</pre>
</div>

<p>
I can "export" the <code>org</code> file to <code>setup.sh</code> with <code>M-x org-babel-tangle</code>.
</p>
</div>
</div>

<div class="outline-2">
<h2 id="recovery-mode-and-setup-sh"><a id="org41ba8e6"></a>Recovery Mode and setup.sh</h2>
<div class="outline-text-2">
<p>
Before erasing all content gathered in 12 months, I quickly offloaded some files to a USB key.
I mostly cared about an "AI for trading" course and some work analyses not in version control.
</p>

<p>
Without thinking too much, I booted in Recovery Mode with cmd+R, erase the HD and reinstalled.
(I found out later that I forgot about my <code>.gnupg</code> folder with my private <code>gpg</code> key..)
</p>

<p>
While running my <code>install.sh</code> script, I realized my main needs:
</p>
<ul class="org-ul">
<li>Emacs (+ Doom)</li>
<li>Dropbox (org)</li>
<li>Password Manager</li>
</ul>

<p>
I could survive with a browser and Emacs for a week.
Okay, maybe I would need Slack for work but not much else.
</p>

<p>
My first impulse was to rebuild <code>gccemacs</code> on my Mac, in parallel to my already big configuration efforts.
To my surprise, the process has been incredibly easy.
Well, maybe because I have already spent a few hours fighting <code>gccemacs</code> in the past weeks.
</p>

<p>
All I did to install it was to clone <a href="https://github.com/jimeh/build-emacs-for-macos">this</a> repo and run:
</p>
<ol class="org-ol">
<li><code>brew bundle</code></li>
<li><code>./build-emacs-for-macos --git-sha d5791ba5feeb5500433ca43506dda13c7c67ce14 feature/native-comp</code></li>
<li>Move the app to <code>Applications</code>.</li>
</ol>

<p>
In the meanwhile, my <code>install.sh</code> script was having some hiccups.
I got somehow 90% of the functionalities working (loads of <code>brew</code> downloads: CLI tools and GUI apps)
I had to manually copy-paste some commands from the harder sections such as <code>install-zsh</code> and <code>restore-dotfiles</code>.
Overall, I am very satisfied: it really saved a lot of time.
</p>

<p>
Once I had built Emacs, I simply had to reinstall Doom.
On its first run with <code>gccemacs</code>, Doom will now compile AOT all packages, which takes a while.
</p>

<p>
Halfway through, I cloned my Doom configuration (stored in git) to <code>.doom.d</code> and build the extra packages in my config.
With minimal effort, few minutes later, I had restored my feature-complete IDE.
<code>straight</code> and <code>Doom</code> in general is amazing.
</p>
</div>
</div>

<div class="outline-2">
<h2 id="last-manual-steps"><a id="org6bf6f74"></a>Last manual steps</h2>
<div class="outline-text-2">
<p>
I then documented some final manual steps I had forgotten to include in my install script.
Some examples:
</p>
<ul class="org-ul">
<li>Forgot to backup SSH keys&#x2026; <code>ssh-keygen</code></li>
<li>My <a href="https://rstudio.github.io/renv/articles/renv.html">renv</a> library does not work. I had to add <code>export R_LIBS_USER=...</code> to my <code>.zshenv</code></li>
<li>Forgot to install pyright.. <code>brew install node &amp;&amp; npm install -g pyright</code></li>
<li>iTerm2 does not send escape sequences.. follow <a href="https://www.clairecodes.com/blog/2018-10-15-making-the-alt-key-work-in-iterm2/">this</a> guide.</li>
</ul>

<p>
It sounds like a waste of time and a lot of work to start from scratch and fight these issues.
I find it a valuable task that lets me learn about my workflow.
I document it and declare it.
</p>

<p>
I have achieved full reproducibility when it comes to my IDE.
Next step is my full computing environment.
That is why I am now looking at <code>nix</code> and <code>home-manager</code>.
Expect a blog post about it in the near future!
</p>
</div>
</div>

  </section>
</article>

    </main>


    
    
    <footer class="footer">
      <div class="ack">
        Made with &#x2665; by
        <a href="https://emacs.love/weblorg" target="_blank">
          weblorg
        </a>
      </div>
    </footer>
    

  </body>
</html>
